In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
np.random.seed(1)
np.random.uniform(size=10).round(0).mean()

np.float64(0.2)

In [6]:
np.random.seed(1)
np.random.uniform(size=100).round(0).mean()

np.float64(0.49)

In [7]:
np.random.seed(1)
np.random.uniform(size=1000).round(0).mean()

np.float64(0.506)

In [8]:
np.random.seed(1)
np.random.uniform(size=10000).round(0).mean()

np.float64(0.501)

# Conditional Probability

## Titanic Analysis 1

In [9]:
titanic_survivors = [
    {
        'gender': 'Male', 'survived': 161, 'did_not_survive': 682
    },
    {
        'gender': 'Female', 'survived': 339, 'did_not_survive': 127
    }
]

In [10]:
titanic = pd.DataFrame(titanic_survivors)
titanic

   gender  survived  did_not_survive
0    Male       161              682
1  Female       339              127

In [11]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   gender           2 non-null      object
 1   survived         2 non-null      int64
 2   did_not_survive  2 non-null      int64
dtypes: int64(2), object(1)
memory usage: 180.0+ bytes

In [12]:
titanic['total'] = titanic['survived'] + titanic['did_not_survive']
titanic

   gender  survived  did_not_survive  total
0    Male       161              682    843
1  Female       339              127    466

In [13]:
total_passengers = titanic['total'].sum()
total_passengers

np.int64(1309)

In [14]:
# whats the probability of a passenger surviving?
total_survived = titanic['survived'].sum()
print(f'total passengers that survived is: {total_survived}')
total_survived / total_passengers

total passengers that survived is: 500

np.float64(0.3819709702062643)

In [15]:
# what the probability of a passenger being male
male_passengers = titanic[titanic['gender'] == 'Male']['total'].sum()
male_passengers

np.int64(843)

In [16]:
# what the probability that a passenger survived given that they are male?
surviving_males = titanic[titanic['gender'] == 'Male']['survived'].sum()
print(f'surviving males = {surviving_males}')
surviving_males / male_passengers

surviving males = 161

np.float64(0.19098457888493475)

In [17]:
# what is the probability of a passenger being female
female_passengers = titanic[titanic['gender'] == 'Female']['total'].sum()
female_passengers / total_passengers

np.float64(0.3559969442322384)

In [18]:
# what is the probability that a passenger survived given that they are female?
surviving_females = titanic[titanic['gender'] == 'Female']['survived']
surviving_females / female_passengers

1    0.727468
Name: survived, dtype: float64

my take on this, is that if you are a passenger in general, your chance of survival is 38%, but if you are a chick, then your chances of surviving increase to 72%. If your a dude, your chances are 20%.

Luckily or unluckily for you, your chances of being a female are 36%.

better be a bitch on the boat

## Titanic Analysis 2

In [19]:
data2 = [
    {
        'class': '1rst', 'survived': 200, 'did_not_survive': 123
    },
    {
        'class': '2nd', 'survived': 119, 'did_not_survive': 158
    },
    {
        'class': '3rd', 'survived': 181, 'did_not_survive': 528
    }
]

In [20]:
t2 = pd.DataFrame(data2)
t2.head()

  class  survived  did_not_survive
0  1rst       200              123
1   2nd       119              158
2   3rd       181              528

In [21]:
t2['total'] = t2['survived'] + t2['did_not_survive']

In [23]:
t2.head()

  class  survived  did_not_survive  total
0  1rst       200              123    323
1   2nd       119              158    277
2   3rd       181              528    709

In [22]:
# get the total number of passengers
total_passengers = t2['total'].sum()
total_passengers

np.int64(1309)

In [23]:
# how many first class passengers survived?
first_class_passengers = t2[t2['class'] == '1rst']['total'].sum()
print(f'first class passengers = {first_class_passengers}')
first_class_survivors = t2[t2['class'] == '1rst']['survived'].sum()
print(f'first class survivors = {first_class_survivors}')
first_class_survivors / first_class_passengers

first class passengers = 323
first class survivors = 200

np.float64(0.6191950464396285)

In [24]:
# how many second class passengers survived?
second_class_passengers = t2[t2['class'] == '2nd']['total'].sum()
print(f'second class passengers = {second_class_passengers}')
second_class_survivors = t2[t2['class'] == '2nd']['survived'].sum()
print(f'second class survivors = {second_class_survivors}')
second_class_survivors / second_class_passengers

second class passengers = 277
second class survivors = 119

np.float64(0.4296028880866426)

In [25]:
# how many third class passengers survived?
third_class_passengers =  t2[t2['class'] == '3rd']['total'].sum()
print(f'thirs class passengers = {third_class_passengers}')
third_class_survivors = t2[t2['class'] == '3rd']['survived'].sum()
print(f'third class survivors = {third_class_passengers}')
third_class_survivors / third_class_passengers

thirs class passengers = 709
third class survivors = 709

np.float64(0.2552891396332863)

- 1rst class chances are 61%
- 2nd class chances are 42%
- 3rs class chances are 25%

## Titanic Analysis 3

In [26]:
titanic

   gender  survived  did_not_survive  total
0    Male       161              682    843
1  Female       339              127    466

In [27]:
t2

  class  survived  did_not_survive  total
0  1rst       200              123    323
1   2nd       119              158    277
2   3rd       181              528    709

In [28]:
index = pd.MultiIndex.from_tuples([
    ('Male', '1st'),
    ('Male', '2nd'),
    ('Male', '3rd'),
    ('Female', '1st'),
    ('Female', '2nd'),
    ('Female', '3rd'),
], names=['gender', 'class'])

data = [
    [61, 118, 179],
    [25, 146, 171],
    [75, 418, 493],
    [139, 5, 144],
    [94, 12, 106],
    [106, 110, 216]
]
columns = ['survived', 'did_not_survive', 'total']

t3 = pd.DataFrame(data, index=index, columns=columns)

In [29]:
t3

              survived  did_not_survive  total
gender class
Male   1st          61              118    179
       2nd          25              146    171
       3rd          75              418    493
Female 1st         139                5    144
       2nd          94               12    106
       3rd         106              110    216

In [30]:
t3.index

MultiIndex([(  'Male', '1st'),
            (  'Male', '2nd'),
            (  'Male', '3rd'),
            ('Female', '1st'),
            ('Female', '2nd'),
            ('Female', '3rd')],
           names=['gender', 'class'])

In [37]:
# what is the probability of surviving given a passenger is femaale and first class?
first_class_females = t3.loc[('Female', '1st')]['total'].sum()
print(f'first class female count is : {first_class_females}')
first_class_females_that_survived = t3.loc[('Female', '1st')]['survived'].sum()
print(f'first class female survivors count is { first_class_females_that_survived}')
first_class_females_that_survived / first_class_females

first class female count is : 144
first class female survivors count is 139

np.float64(0.9652777777777778)

## Multiplication and Addition properties

### Multiplication

If we have independent events and we want to know if both events happen we use multiplication

$
P(E_1 and E_2) = P(E_1) \times P(E_2)
$

### Addition

If we have not mutually exclusive events and we want to know if either occured, we use addition but with a catch

$
P(E_1 \text{ or }  E_2) = P(E_1 \cup E_2) = P(E_1) + P(E_2) - P(E_1 \cap E_2)
$

![probability1](../images/probability_1.png)

If we just add A and B, then we are double counting the intersection between the two so that is why we need to subtract it

$ \cup $ = Union

$ \cap $ = Intersection

If you have a mutally exclusive events, then the intersection would always be zero

This makes the equation simpler becuase we no longer need to subract the intersection so we would have this:

$
P(E_1 or E_2) = P(E_1 \cup E_2) = P(E_1) + P(E_2)
$

Mutually exclusive event - Occurance of event A excludes the occurence of event B

Independent Events - Occurance of event A is not way influenced by the occurance of event B

![p1](../images/probability_2.png)